Revit 2027 API
LinkOriginFileType Enumeration
 Enum determining whether the source type of a temporary rvt link is an ifc.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum LinkOriginFileType
Public Enumeration LinkOriginFileType
public enum class LinkOriginFileType
type LinkOriginFileType
Members
Member name | Value | Description
IFC | 1 |  The original link file is an ifc file.
RVT | 0 |  Default RVT, curently only support ifc.
See Also
Reference
Autodesk.Revit.DB Namespace